In [1]:
from sqlalchemy import create_engine

%load_ext sql

drivername = "postgresql"
username = "postgres"
password = "postgres"
host = "localhost"
port = "5432"
database = "analysis"

db_url = f"{drivername}://{username}:{password}@{host}/{database}"
engine = create_engine(db_url)

%sql engine

In [3]:
%%sql
table teachers;

Running query in 'postgresql://postgres:***@localhost/analysis'

6 rows affected.

+----+------------+-----------+---------------------+------------+--------+
| id | first_name | last_name |        school       | hire_date  | salary |
+----+------------+-----------+---------------------+------------+--------+
| 1  |   Janet    |   Smith   |  F.D. Roosevelt HS  | 2011-10-30 | 36200  |
| 2  |    Lee     |  Reynolds |  F.D. Roosevelt HS  | 1993-05-22 | 65000  |
| 3  |   Samuel   |    Cole   | Myers Middle School | 2005-08-01 | 43500  |
| 4  |  Samantha  |    Bush   | Myers Middle School | 2011-10-30 | 36200  |
| 5  |   Betty    |    Diaz   | Myers Middle School | 2005-08-30 | 43500  |
| 6  |  Kathleen  |   Roush   |  F.D. Roosevelt HS  | 2010-10-22 | 38500  |
+----+------------+-----------+---------------------+------------+--------+

In [4]:
%%sql
SELECT last_name, first_name, salary FROM teachers;

Running query in 'postgresql://postgres:***@localhost/analysis'

6 rows affected.

+-----------+------------+--------+
| last_name | first_name | salary |
+-----------+------------+--------+
|   Smith   |   Janet    | 36200  |
|  Reynolds |    Lee     | 65000  |
|    Cole   |   Samuel   | 43500  |
|    Bush   |  Samantha  | 36200  |
|    Diaz   |   Betty    | 43500  |
|   Roush   |  Kathleen  | 38500  |
+-----------+------------+--------+

In [5]:
%%sql
SELECT first_name, last_name, salary
FROM teachers
ORDER BY salary DESC;

Running query in 'postgresql://postgres:***@localhost/analysis'

6 rows affected.

+------------+-----------+--------+
| first_name | last_name | salary |
+------------+-----------+--------+
|    Lee     |  Reynolds | 65000  |
|   Samuel   |    Cole   | 43500  |
|   Betty    |    Diaz   | 43500  |
|  Kathleen  |   Roush   | 38500  |
|   Janet    |   Smith   | 36200  |
|  Samantha  |    Bush   | 36200  |
+------------+-----------+--------+

In [12]:
%%sql
SELECT last_name, school, hire_date
FROM teachers
ORDER BY school ASC, hire_date DESC;

Running query in 'postgresql://postgres:***@localhost/analysis'

6 rows affected.

+-----------+---------------------+------------+
| last_name |        school       | hire_date  |
+-----------+---------------------+------------+
|   Smith   |  F.D. Roosevelt HS  | 2011-10-30 |
|   Roush   |  F.D. Roosevelt HS  | 2010-10-22 |
|  Reynolds |  F.D. Roosevelt HS  | 1993-05-22 |
|    Bush   | Myers Middle School | 2011-10-30 |
|    Diaz   | Myers Middle School | 2005-08-30 |
|    Cole   | Myers Middle School | 2005-08-01 |
+-----------+---------------------+------------+